<template>
  <div class="content">
    <h2 class="title">よくあるミスを確認する</h2>

    <p>プログラミングを学習しているうちにうまく動かなかったりすることがあると思います。
      そのようなときには以下のようなミスが原因かもしれません。
    </p>

    <ul>
      <li>全角、半角が間違えている</li>
      <li>スペースが足りない、全角スペースになっている</li>
      <li>シングル、ダブルクォーテーションが混ざっている</li>
      <li>開き記号と閉じ記号があっていない</li>
    </ul>

    <p>これらは<nuxt-link to="/need_to_do_programming#editor">エディタ</nuxt-link>が警告やエラーを出してくれ解決してくれることがある為、まずエディタを見直してみましょう</p>

    <h3>全角、半角が間違えている</h3>

    <p>まずパソコンでは全角入力、半角入力という文字の入力方法、種別の違いがあります。</p>
    <p>半角: A, 全角: Ａ</p>
    <p>見た目上は大きさが多少違う程度ですがプログラミングでは重要な違いになります。
      プログラミングでは全角を使うケースはほぼない、為全角ではエラーになることが多いです。
      見た目上は正しく入力されているが何故かエラーになる。という場合は半角、全角を見直してみましょう。
    </p>

    <h3>スペースが足りない、全角スペースになっている</h3>
    <p>半角全角の話と近い話になりますが、スペースにも半角全角があります。</p>
    <p>以下は、全く意味のない javascript のコードです。</p>
    <p>例えば、<strong>if</strong>と<strong>(</strong>の間にはスペースを入力しますが、全角スペースはエラーになります。
      最近の<nuxt-link to="/need_to_do_programming#editor">エディタ</nuxt-link>では半角しか入力できないシーンでは、自動的に半角にしてくれたりします。</p>
    <pre>
      <code>
        const name = "田中";
        if (name === "田中") {
          console.log("田中");
        }
      </code>
    </pre>
    <p>スペースが必要なシーンでは全角になっているか、半角になっているかを確認しましょう。</p>
    <p>以下は、全く意味のない htmlのdiv のコードです。</p>
    <p>divにはclass1, class2とclass名を指定したいように見えますが、class1とclass2の間にはスペースがないため、
      <strong>class1class2</strong>というclass名として認識されています。
      エラーにはなりませんが意図した動作にはならない為、慣れていないと原因を見つけるのに苦労するかもしれせん。
    </p>
    <pre>
      &lt;code&gt;
        &lt;div class=&quot;class1class2&quot;&gt;何か表示したいdiv&lt;/div&gt;
      &lt;/code&gt;
    </pre>

    <h3>シングル, ダブルクォーテーションが混ざっている</h3>
    <p>以下は、全く意味のない htmlのdiv のコードです。</p>
    <p>class指定がダブルクォーテーションで始まっていますが、シングルクォーテーションで閉じています。
      シングル、ダブルのどちらでも使用することは可能ですが、必ず開くときと閉じるときで同じ記号を使用する必要があります。
    </p>
    <pre>
      <code>
        &amp;lt;div class=&quot;class1'&gt;何か表示したいdiv&amp;lt;/div&amp;gt;
      </code>
    </pre>  

    <h3>開き記号と閉じ記号があっていない</h3>
    <p>以下は全く意味のない javascript のコードです。</p>
    <p>if文は{}でくくりますが、{で始まり]で閉じています。クォーテーション同様、この手のものは開きと閉じで同じ記号を使用する必要があります。</p>
    <pre>
      <code>
        const name = "田中";
        if (name === "田中") {
          console.log("田中");
        ]
      </code>
    </pre>

    <h3>まとめ</h3>
    <p>プログラミングは些細なミスで動かなくなることがよくあります。
      慣れてくるとミスも減りますしミスをしてもすぐに気付けるようになるのですが
      始めはタイピング（キーボードで入力すること）も慣れていないとミスが多く発生すると思います。</p>
    <p>見直しても、ミスがわからない場合はいっそのこと怪しいところをすべて消して書き直すとうまくいくことがあります。</p>
    <p>悩むくらいならやり直してみましょう</p>

    <div class="content-footer is-clearfix">
      <nuxt-link to="/retry">
        <button class="button is-link is-pulled-right">次へ</button>
      </nuxt-link>
    </div>
  </div>
</template>

<script>
</script>

<style>
</style>
