<template>
  <div class="content">
    <h2 class="title">違う学習方法を試したりやり直す</h2>

    <p>なんか（プログラミング）がうまくできないかも、自分には難しかったかも・・・
      みたいに思うことがよくあると思います。
    </p>

    <p>誰でも最初はつまずくことがあります。
      そんな時にはいっそのこと別のことをやってみたり、同じことをやり直してみるのがいいかもしれません。
    </p>

    <p>例えば、学習サイトの途中でつまずいたらその項目を最初からやり直してみたり、全く別のコースをやってみたり、
      別の学習サイトを使ってみたり。</p>
    <p>なぜそういうことをしたらいいかというと、学習サイト等は効率よく学習するためにどうしても説明が足りなくなっているところがあったり、
      人それぞれつまずくところが違うのでカバーしきれないところがあります。
      そういうときはもう一度最初からやってみたら1度目には理解できなくてスルーしていたところが頭に入ってきたり、
      別のサイトでやってみたら自分がつまずいていた、疑問に思っていたところの説明があったり
      新たな発見があるかもしれません。
    </p>

    <p>誰でも最初からスムーズにできることはありません。つまずくところの違いで誰でもつまずきます。
      諦めずに地道に、理解を深めていけばある日一気に階段をかけあがるときがくると思います。</p>
  </div>
</template>

<script>
</script>

<style>
</style>
